/* automatically generated by rust-bindgen 0.69.2 */
#![allow(non_upper_case_globals)]
#![allow(non_camel_case_types)]
#![allow(non_snake_case)]
#![allow(unused_attributes)]

#[repr(u32)]
#[doc = " CUDA error types"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cudaError {
    #[doc = " The API call returned with no errors. In the case of query calls, this\n also means that the operation being queried is complete (see\n ::cudaEventQuery() and ::cudaStreamQuery())."]
    cudaSuccess = 0,
    #[doc = " This indicates that one or more of the parameters passed to the API call\n is not within an acceptable range of values."]
    cudaErrorInvalidValue = 1,
    #[doc = " The API call failed because it was unable to allocate enough memory to\n perform the requested operation."]
    cudaErrorMemoryAllocation = 2,
    #[doc = " The API call failed because the CUDA driver and runtime could not be\n initialized."]
    cudaErrorInitializationError = 3,
    #[doc = " This indicates that a CUDA Runtime API call cannot be executed because\n it is being called during process shut down, at a point in time after\n CUDA driver has been unloaded."]
    cudaErrorCudartUnloading = 4,
    #[doc = " This indicates profiler is not initialized for this run. This can\n happen when the application is running with external profiling tools\n like visual profiler."]
    cudaErrorProfilerDisabled = 5,

pub enum cuvsError_t {
    CUVS_ERROR = 0,
    CUVS_SUCCESS = 1,
}
extern "C" {
    #[must_use]
    #[doc = " @brief Create an Initialized opaque C handle for C++ type `raft::resources`\n\n @param[in] res cuvsResources_t opaque C handle\n @return cuvsError_t"]
    pub fn cuvsResourcesCreate(res: *mut cuvsResources_t) -> cuvsError_t;
}
extern "C" {
    #[must_use]
    #[doc = " @brief Destroy and de-allocate opaque C handle for C++ type `raft::resources`\n\n @param[in] res cuvsResources_t opaque C handle\n @return cuvsError_t"]
    pub fn cuvsResourcesDestroy(res: cuvsResources_t) -> cuvsError_t;
}
extern "C" {
    #[must_use]
    #[doc = " @brief Set cudaStream_t on cuvsResources_t to queue CUDA kernels on APIs\n        that accept a cuvsResources_t handle\n\n @param[in] res cuvsResources_t opaque C handle\n @param[in] stream cudaStream_t stream to queue CUDA kernels\n @return cuvsError_t"]
    pub fn cuvsStreamSet(res: cuvsResources_t, stream: cudaStream_t) -> cuvsError_t;
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum DLDeviceType {
    #[doc = " \\brief CPU device"]
    kDLCPU = 1,
    #[doc = " \\brief CUDA GPU device"]
    kDLCUDA = 2,
    #[doc = " \\brief Pinned CUDA CPU memory by cudaMallocHost"]
    kDLCUDAHost = 3,
    #[doc = " \\brief OpenCL devices."]
    kDLOpenCL = 4,
    #[doc = " \\brief Vulkan buffer for next generation graphics."]
    kDLVulkan = 7,
    #[doc = " \\brief Metal for Apple GPU."]
    kDLMetal = 8,
    #[doc = " \\brief Verilog simulator buffer"]
    kDLVPI = 9,
    #[doc = " \\brief ROCm GPUs for AMD GPUs"]
    kDLROCM = 10,
    #[doc = " \\brief Pinned ROCm CPU memory allocated by hipMallocHost"]
    kDLROCMHost = 11,
    #[doc = " \\brief Reserved extension device type,\n used for quickly test extension device\n The semantics can differ depending on the implementation."]
    kDLExtDev = 12,
    #[doc = " \\brief CUDA managed/unified memory allocated by cudaMallocManaged"]
    kDLCUDAManaged = 13,
    #[doc = " \\brief Unified shared memory allocated on a oneAPI non-partititioned\n device. Call to oneAPI runtime is required to determine the device\n type, the USM allocation type and the sycl context it is bound to.\n"]
    kDLOneAPI = 14,
    #[doc = " \\brief GPU support for next generation WebGPU standard."]
    kDLWebGPU = 15,
    #[doc = " \\brief Qualcomm Hexagon DSP"]
    kDLHexagon = 16,
}
#[doc = " \\brief A Device for Tensor and operator."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DLDevice {
    #[doc = " \\brief The device type used in the device."]
    pub device_type: DLDeviceType,
    #[doc = " \\brief The device index.\n For vanilla CPU memory, pinned memory, or managed memory, this is set to 0."]
    pub device_id: i32,
}
#[test]
fn bindgen_test_layout_DLDevice() {
    const UNINIT: ::std::mem::MaybeUninit<DLDevice> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<DLDevice>(),
        8usize,
        concat!("Size of: ", stringify!(DLDevice))
    );
    assert_eq!(
        ::std::mem::align_of::<DLDevice>(),
        4usize,
        concat!("Alignment of ", stringify!(DLDevice))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).device_type) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DLDevice),
            "::",
            stringify!(device_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).device_id) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DLDevice),
            "::",
            stringify!(device_id)
        )
    );
}
#[repr(u32)]
#[doc = " \\brief The type code options DLDataType."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum DLDataTypeCode {
    #[doc = " \\brief signed integer"]
    kDLInt = 0,
    #[doc = " \\brief unsigned integer"]
    kDLUInt = 1,
    #[doc = " \\brief IEEE floating point"]
    kDLFloat = 2,
    #[doc = " \\brief Opaque handle type, reserved for testing purposes.\n Frameworks need to agree on the handle data type for the exchange to be well-defined."]
    kDLOpaqueHandle = 3,
    #[doc = " \\brief bfloat16"]
    kDLBfloat = 4,
    #[doc = " \\brief complex number\n (C/C++/Python layout: compact struct per complex number)"]
    kDLComplex = 5,
    #[doc = " \\brief boolean"]
    kDLBool = 6,
}
#[doc = " \\brief The data type the tensor can hold. The data type is assumed to follow the\n native endian-ness. An explicit error message should be raised when attempting to\n export an array with non-native endianness\n\n  Examples\n   - float: type_code = 2, bits = 32, lanes = 1\n   - float4(vectorized 4 float): type_code = 2, bits = 32, lanes = 4\n   - int8: type_code = 0, bits = 8, lanes = 1\n   - std::complex<float>: type_code = 5, bits = 64, lanes = 1\n   - bool: type_code = 6, bits = 8, lanes = 1 (as per common array library convention, the underlying storage size of bool is 8 bits)"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DLDataType {
    #[doc = " \\brief Type code of base types.\n We keep it uint8_t instead of DLDataTypeCode for minimal memory\n footprint, but the value should be one of DLDataTypeCode enum values."]
    pub code: u8,
    #[doc = " \\brief Number of bits, common choices are 8, 16, 32."]
    pub bits: u8,
    #[doc = " \\brief Number of lanes in the type, used for vector types."]
    pub lanes: u16,
}
#[test]
fn bindgen_test_layout_DLDataType() {
    const UNINIT: ::std::mem::MaybeUninit<DLDataType> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<DLDataType>(),
        4usize,
        concat!("Size of: ", stringify!(DLDataType))
    );
    assert_eq!(
        ::std::mem::align_of::<DLDataType>(),
        2usize,
        concat!("Alignment of ", stringify!(DLDataType))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).code) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DLDataType),
            "::",
            stringify!(code)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bits) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(DLDataType),
            "::",
            stringify!(bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lanes) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(DLDataType),
            "::",
            stringify!(lanes)
        )
    );
}
#[doc = " \\brief Plain C Tensor object, does not manage memory."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DLTensor {
    #[doc = " \\brief The data pointer points to the allocated data. This will be CUDA\n device pointer or cl_mem handle in OpenCL. It may be opaque on some device\n types. This pointer is always aligned to 256 bytes as in CUDA. The\n `byte_offset` field should be used to point to the beginning of the data.\n\n Note that as of Nov 2021, multiply libraries (CuPy, PyTorch, TensorFlow,\n TVM, perhaps others) do not adhere to this 256 byte alignment requirement\n on CPU/CUDA/ROCm, and always use `byte_offset=0`.  This must be fixed\n (after which this note will be updated); at the moment it is recommended\n to not rely on the data pointer being correctly aligned.\n\n For given DLTensor, the size of memory required to store the contents of\n data is calculated as follows:\n\n \\code{.c}\n static inline size_t GetDataSize(const DLTensor* t) {\n   size_t size = 1;\n   for (tvm_index_t i = 0; i < t->ndim; ++i) {\n     size *= t->shape[i];\n   }\n   size *= (t->dtype.bits * t->dtype.lanes + 7) / 8;\n   return size;\n }\n \\endcode"]
    pub data: *mut ::std::os::raw::c_void,
    #[doc = " \\brief The device of the tensor"]
    pub device: DLDevice,
    #[doc = " \\brief Number of dimensions"]
    pub ndim: i32,
    #[doc = " \\brief The data type of the pointer"]
    pub dtype: DLDataType,
    #[doc = " \\brief The shape of the tensor"]
    pub shape: *mut i64,
    #[doc = " \\brief strides of the tensor (in number of elements, not bytes)\n  can be NULL, indicating tensor is compact and row-majored."]
    pub strides: *mut i64,
    #[doc = " \\brief The offset in bytes to the beginning pointer to data"]
    pub byte_offset: u64,
}
#[test]
fn bindgen_test_layout_DLTensor() {
    const UNINIT: ::std::mem::MaybeUninit<DLTensor> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<DLTensor>(),
        48usize,
        concat!("Size of: ", stringify!(DLTensor))
    );
    assert_eq!(
        ::std::mem::align_of::<DLTensor>(),
        8usize,
        concat!("Alignment of ", stringify!(DLTensor))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DLTensor),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).device) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DLTensor),
            "::",
            stringify!(device)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ndim) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(DLTensor),
            "::",
            stringify!(ndim)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dtype) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(DLTensor),
            "::",
            stringify!(dtype)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).shape) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(DLTensor),
            "::",
            stringify!(shape)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).strides) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(DLTensor),
            "::",
            stringify!(strides)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).byte_offset) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(DLTensor),
            "::",
            stringify!(byte_offset)
        )
    );
}
#[doc = " \\brief C Tensor object, manage memory of DLTensor. This data structure is\n  intended to facilitate the borrowing of DLTensor by another framework. It is\n  not meant to transfer the tensor. When the borrowing framework doesn't need\n  the tensor, it should call the deleter to notify the host that the resource\n  is no longer needed."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DLManagedTensor {
    #[doc = " \\brief DLTensor which is being memory managed"]
    pub dl_tensor: DLTensor,
    #[doc = " \\brief the context of the original host framework of DLManagedTensor in\n   which DLManagedTensor is used in the framework. It can also be NULL."]
    pub manager_ctx: *mut ::std::os::raw::c_void,
    #[doc = " \\brief Destructor signature void (*)(void*) - this should be called\n   to destruct manager_ctx which holds the DLManagedTensor. It can be NULL\n   if there is no way for the caller to provide a reasonable destructor.\n   The destructors deletes the argument self as well."]
    pub deleter: ::std::option::Option<unsafe extern "C" fn(self_: *mut DLManagedTensor)>,
}
#[test]
fn bindgen_test_layout_DLManagedTensor() {
    const UNINIT: ::std::mem::MaybeUninit<DLManagedTensor> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<DLManagedTensor>(),
        64usize,
        concat!("Size of: ", stringify!(DLManagedTensor))
    );
    assert_eq!(
        ::std::mem::align_of::<DLManagedTensor>(),
        8usize,
        concat!("Alignment of ", stringify!(DLManagedTensor))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dl_tensor) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DLManagedTensor),
            "::",
            stringify!(dl_tensor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).manager_ctx) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(DLManagedTensor),
            "::",
            stringify!(manager_ctx)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).deleter) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(DLManagedTensor),
            "::",
            stringify!(deleter)
        )
    );
}
#[repr(u32)]
#[doc = " @brief Enum to denote which ANN algorithm is used to build CAGRA graph\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cagraGraphBuildAlgo {
    IVF_PQ = 0,
    NN_DESCENT = 1,
}
#[doc = " @brief Supplemental parameters to build CAGRA Index\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cagraIndexParams {
    #[doc = " Degree of input graph for pruning."]
    pub intermediate_graph_degree: usize,
    #[doc = " Degree of output graph."]
    pub graph_degree: usize,
    #[doc = " ANN algorithm to build knn graph."]
    pub build_algo: cagraGraphBuildAlgo,
    #[doc = " Number of Iterations to run if building with NN_DESCENT"]
    pub nn_descent_niter: usize,
}
#[test]
fn bindgen_test_layout_cagraIndexParams() {
    const UNINIT: ::std::mem::MaybeUninit<cagraIndexParams> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cagraIndexParams>(),
        32usize,
        concat!("Size of: ", stringify!(cagraIndexParams))
    );
    assert_eq!(
        ::std::mem::align_of::<cagraIndexParams>(),
        8usize,
        concat!("Alignment of ", stringify!(cagraIndexParams))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).intermediate_graph_degree) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cagraIndexParams),
            "::",
            stringify!(intermediate_graph_degree)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).graph_degree) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cagraIndexParams),
            "::",
            stringify!(graph_degree)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).build_algo) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(cagraIndexParams),
            "::",
            stringify!(build_algo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nn_descent_niter) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(cagraIndexParams),
            "::",
            stringify!(nn_descent_niter)
        )
    );
}
pub type cuvsCagraIndexParams_t = *mut cagraIndexParams;
extern "C" {
    #[must_use]
    #[doc = " @brief Allocate CAGRA Index params, and populate with default values\n\n @param[in] params cuvsCagraIndexParams_t to allocate\n @return cuvsError_t"]
    pub fn cuvsCagraIndexParamsCreate(params: *mut cuvsCagraIndexParams_t) -> cuvsError_t;
}
extern "C" {
    #[must_use]
    #[doc = " @brief De-allocate CAGRA Index params\n\n @param[in] params\n @return cuvsError_t"]
    pub fn cuvsCagraIndexParamsDestroy(index: cuvsCagraIndexParams_t) -> cuvsError_t;
}
#[repr(u32)]
#[doc = " @brief Enum to denote algorithm used to search CAGRA Index\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cagraSearchAlgo {
    #[doc = " For large batch sizes."]
    SINGLE_CTA = 0,
    #[doc = " For small batch sizes."]
    MULTI_CTA = 1,
    #[doc = " For small batch sizes."]
    MULTI_KERNEL = 2,
    #[doc = " For small batch sizes."]
    AUTO = 3,
}
#[repr(u32)]
#[doc = " @brief Enum to denote Hash Mode used while searching CAGRA index\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cagraHashMode {
    HASH = 0,
    SMALL = 1,
    AUTO_HASH = 2,
}
#[doc = " @brief Supplemental parameters to search CAGRA index\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cagraSearchParams {
    #[doc = " Maximum number of queries to search at the same time (batch size). Auto select when 0."]
    pub max_queries: usize,
    #[doc = " Number of intermediate search results retained during the search.\n\n  This is the main knob to adjust trade off between accuracy and search speed.\n  Higher values improve the search accuracy."]
    pub itopk_size: usize,
    #[doc = " Upper limit of search iterations. Auto select when 0."]
    pub max_iterations: usize,
    #[doc = " Which search implementation to use."]
    pub algo: cagraSearchAlgo,
    #[doc = " Number of threads used to calculate a single distance. 4, 8, 16, or 32."]
    pub team_size: usize,
    #[doc = " Number of graph nodes to select as the starting point for the search in each iteration. aka\n search width?"]
    pub search_width: usize,
    #[doc = " Lower limit of search iterations."]
    pub min_iterations: usize,
    #[doc = " Thread block size. 0, 64, 128, 256, 512, 1024. Auto selection when 0."]
    pub thread_block_size: usize,
    #[doc = " Hashmap type. Auto selection when AUTO."]
    pub hashmap_mode: cagraHashMode,
    #[doc = " Lower limit of hashmap bit length. More than 8."]
    pub hashmap_min_bitlen: usize,
    #[doc = " Upper limit of hashmap fill rate. More than 0.1, less than 0.9."]
    pub hashmap_max_fill_rate: f32,
    #[doc = " Number of iterations of initial random seed node selection. 1 or more."]
    pub num_random_samplings: u32,
    #[doc = " Bit mask used for initial random seed node selection."]
    pub rand_xor_mask: u64,
}
#[test]
fn bindgen_test_layout_cagraSearchParams() {
    const UNINIT: ::std::mem::MaybeUninit<cagraSearchParams> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cagraSearchParams>(),
        96usize,
        concat!("Size of: ", stringify!(cagraSearchParams))
    );
    assert_eq!(
        ::std::mem::align_of::<cagraSearchParams>(),
        8usize,
        concat!("Alignment of ", stringify!(cagraSearchParams))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_queries) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cagraSearchParams),
            "::",
            stringify!(max_queries)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).itopk_size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cagraSearchParams),
            "::",
            stringify!(itopk_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_iterations) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(cagraSearchParams),
            "::",
            stringify!(max_iterations)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).algo) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(cagraSearchParams),
            "::",
            stringify!(algo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).team_size) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(cagraSearchParams),
            "::",
            stringify!(team_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).search_width) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(cagraSearchParams),
            "::",
            stringify!(search_width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min_iterations) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(cagraSearchParams),
            "::",
            stringify!(min_iterations)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).thread_block_size) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(cagraSearchParams),
            "::",
            stringify!(thread_block_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hashmap_mode) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(cagraSearchParams),
            "::",
            stringify!(hashmap_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hashmap_min_bitlen) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(cagraSearchParams),
            "::",
            stringify!(hashmap_min_bitlen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hashmap_max_fill_rate) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(cagraSearchParams),
            "::",
            stringify!(hashmap_max_fill_rate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_random_samplings) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(cagraSearchParams),
            "::",
            stringify!(num_random_samplings)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rand_xor_mask) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(cagraSearchParams),
            "::",
            stringify!(rand_xor_mask)
        )
    );
}
pub type cuvsCagraSearchParams_t = *mut cagraSearchParams;
extern "C" {
    #[must_use]
    #[doc = " @brief Allocate CAGRA search params, and populate with default values\n\n @param[in] params cuvsCagraSearchParams_t to allocate\n @return cuvsError_t"]
    pub fn cuvsCagraSearchParamsCreate(params: *mut cuvsCagraSearchParams_t) -> cuvsError_t;
}
extern "C" {
    #[must_use]
    #[doc = " @brief De-allocate CAGRA search params\n\n @param[in] params\n @return cuvsError_t"]
    pub fn cuvsCagraSearchParamsDestroy(params: cuvsCagraSearchParams_t) -> cuvsError_t;
}
#[doc = " @brief Struct to hold address of cuvs::neighbors::cagra::index and its active trained dtype\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cagraIndex {
    pub addr: usize,
    pub dtype: DLDataType,
}
#[test]
fn bindgen_test_layout_cagraIndex() {
    const UNINIT: ::std::mem::MaybeUninit<cagraIndex> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cagraIndex>(),
        16usize,
        concat!("Size of: ", stringify!(cagraIndex))
    );
    assert_eq!(
        ::std::mem::align_of::<cagraIndex>(),
        8usize,
        concat!("Alignment of ", stringify!(cagraIndex))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cagraIndex),
            "::",
            stringify!(addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dtype) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cagraIndex),
            "::",
            stringify!(dtype)
        )
    );
}
pub type cagraIndex_t = *mut cagraIndex;
extern "C" {
    #[must_use]
    #[doc = " @brief Allocate CAGRA index\n\n @param[in] index cagraIndex_t to allocate\n @return cagraError_t"]
    pub fn cagraIndexCreate(index: *mut cagraIndex_t) -> cuvsError_t;
}
extern "C" {
    #[must_use]
    #[doc = " @brief De-allocate CAGRA index\n\n @param[in] index cagraIndex_t to de-allocate"]
    pub fn cagraIndexDestroy(index: cagraIndex_t) -> cuvsError_t;
}
extern "C" {
    #[must_use]
